package main

import "fmt"

func main() {
	fmt.Println("---------------------------------")
	s1 := []int{1, 2, 3, 4, 5, 6}
	idx := 2 // 삭제할 인덱스
	fmt.Println("s1:", s1, len(s1), cap(s1))
	for i := idx + 1; i < len(s1); i++ {
		s1[i-1] = s1[i]
	}
	fmt.Println("s1:", s1, len(s1), cap(s1))
	s1 = s1[:len(s1)-1] // 마지막값을 잘라줌
	fmt.Println("s1:", s1, len(s1), cap(s1))
	fmt.Println("---------------------------------")
	// 코드 개선
	s1 = []int{1, 2, 3, 4, 5, 6}
	s1 = append(s1[:idx], s1[idx+1:]...)
	fmt.Println("s1:", s1, len(s1), cap(s1))
	fmt.Println("---------------------------------")
	s2 := []int{1, 2, 3, 4, 5, 6}
	s3 := s2[:idx]
	s4 := s2[idx+1:]
	fmt.Println("s2:", s2, len(s2), cap(s2))
	fmt.Println("s3:", s3, len(s3), cap(s3))
	fmt.Println("s4:", s4, len(s4), cap(s4))
	fmt.Println("---------------------------------")
}

// ---------------------------------
// s1: [1 2 3 4 5 6] 6 6
// s1: [1 2 4 5 6 6] 6 6
// s1: [1 2 4 5 6] 5 6
// ---------------------------------
// s1: [1 2 4 5 6] 5 6
// ---------------------------------
// s2: [1 2 3 4 5 6] 6 6
// s3: [1 2] 2 6
// s4: [4 5 6] 3 3
// ---------------------------------
