package main

import "fmt"

func main() {
	fmt.Println("---------------------------------")
	s1 := []int{1, 2, 3, 4, 5}
	s2 := make([]int, len(s1))
	fmt.Println("s1:", s1, len(s1), cap(s1))
	fmt.Println("s2:", s2, len(s2), cap(s2))
	fmt.Println("---------------------------------")
	for i, v := range s1 {
		s2[i] = v
	}
	fmt.Println("s1:", s1, len(s1), cap(s1))
	fmt.Println("s2:", s2, len(s2), cap(s2))
	fmt.Println("---------------------------------")
	s1[1] = 100
	fmt.Println("s1:", s1, len(s1), cap(s1))
	fmt.Println("s2:", s2, len(s2), cap(s2))
	fmt.Println("---------------------------------")
	// 코드개선
	// append() 함수를 사용해 s1의 모든 값을 복제한 새로운 슬라이스를 만들어서 s3에 대입
	// 배열이나 슬라이스 뒤에 ...를 하면 모든 요솟값을 넣어준 것과 같게 됩니다.
	s3 := append([]int{}, s1...)
	// 아래와 같다.
	// s3 := append([]int{}, slice1[0], slice1[1], slice1[2], slice1[3], slice1[4])
	fmt.Println("s1:", s1, len(s1), cap(s1))
	fmt.Println("s2:", s2, len(s2), cap(s2))
	fmt.Println("s3:", s3, len(s3), cap(s3))
	fmt.Println("---------------------------------")
	// 첫 번째 인수로 복사한 결과를 저장하는 슬라이스 변수를넣고,
	// 두 번째 인수로 복사 대상이 되는 슬라이스 변수를 넣습니다.
	// 반환값은 실제로 복사된 요소 개수입니다.
	s4 := []int{1, 2, 3, 4, 5}
	s5 := make([]int, 3, 10) // len:3 , cap:10 슬라이스
	s6 := make([]int, 10)    // len:10, cap:10 슬라이스
	fmt.Println("s4:", s4, len(s4), cap(s4))
	fmt.Println("s5:", s5, len(s5), cap(s5))
	fmt.Println("s6:", s6, len(s6), cap(s6))
	fmt.Println("---------------------------------")
	cnt1 := copy(s5, s4)
	cnt2 := copy(s6, s4)
	fmt.Println("s4:", s4, len(s4), cap(s4))
	fmt.Println("s5:", s5, len(s5), cap(s5), " 복사개수:", cnt1)
	fmt.Println("s6:", s6, len(s6), cap(s6), " 복사개수:", cnt2)
	fmt.Println("---------------------------------")

}

// ---------------------------------
// s1: [1 2 3 4 5] 5 5
// s2: [0 0 0 0 0] 5 5
// ---------------------------------
// s1: [1 2 3 4 5] 5 5
// s2: [1 2 3 4 5] 5 5
// ---------------------------------
// s1: [1 100 3 4 5] 5 5
// s2: [1 2 3 4 5] 5 5
// ---------------------------------
// s1: [1 100 3 4 5] 5 5
// s2: [1 2 3 4 5] 5 5
// s3: [1 100 3 4 5] 5 6
// ---------------------------------
// s4: [1 2 3 4 5] 5 5
// s5: [0 0 0] 3 10
// s6: [0 0 0 0 0 0 0 0 0 0] 10 10
// ---------------------------------
// s4: [1 2 3 4 5] 5 5
// s5: [1 2 3] 3 10  복사개수: 3
// s6: [1 2 3 4 5 0 0 0 0 0] 10 10  복사개수: 5
// ---------------------------------
