package main

import "fmt"

func main() {
	fmt.Println("---------------------------------")
	s1 := []int{1, 2, 3, 4, 5, 6}
	fmt.Println("s1:", s1)
	s1 = append(s1, 0) // 맨뒤에 요소추가
	idx := 2
	for i := len(s1) - 2; i >= idx; i-- {
		s1[i+1] = s1[i]
	}
	fmt.Println("s1:", s1)
	s1[idx] = 100
	fmt.Println("s1:", s1)
	fmt.Println("---------------------------------")
	// 한줄로 바꿈
	s2 := []int{1, 2, 3, 4, 5, 6}
	fmt.Println("s2:", s2)
	// append([]int{100}, s2[idx:]...)
	// 임시슬라이스 생성 -> 메모리 추가 사용
	s2 = append(s2[:idx], append([]int{100}, s2[idx:]...)...)
	fmt.Println("s2:", s2)
	fmt.Println("---------------------------------")
	// 메모리 사용하지 않는 버전
	s3 := []int{1, 2, 3, 4, 5, 6}
	fmt.Println("s3:", s3, len(s3), cap(s3))
	s3 = append(s3, 0) // 맨뒤에 요소 추가
	fmt.Println("s3:", s3, len(s3), cap(s3))
	copy(s3[idx+1:], s3[idx:]) // 값복사
	fmt.Println("s3:", s3, len(s3), cap(s3))
	s3[idx] = 100
	fmt.Println("s3:", s3, len(s3), cap(s3))
	fmt.Println("---------------------------------")
}

// ---------------------------------
// s1: [1 2 3 4 5 6]
// s1: [1 2 3 3 4 5 6]
// s1: [1 2 100 3 4 5 6]
// ---------------------------------
// s2: [1 2 3 4 5 6]
// s2: [1 2 100 3 4 5 6]
// ---------------------------------
// s3: [1 2 3 4 5 6] 6 6
// s3: [1 2 3 4 5 6 0] 7 12
// s3: [1 2 3 3 4 5 6] 7 12
// s3: [1 2 100 3 4 5 6] 7 12
// ---------------------------------
