package main

import "fmt"

func main() {
	str := "Hello 월드"

	fmt.Println("len(str):", len(str)) // 글자의 바이트수 반환
	for i := 0; i < len(str); i++ {
		fmt.Printf("타입:%T, 값:%d, 문자값:%c\n", str[i], str[i], str[i])
	}
	fmt.Printf("---------------------------------\n")
	arr := []rune(str)
	fmt.Println("len(arr):", len(arr)) // 글자의 개수 반환
	for i := 0; i < len(arr); i++ {
		fmt.Printf("타입:%T, 값:%d, 문자값:%c\n", arr[i], arr[i], arr[i])
	}
	fmt.Printf("---------------------------------\n")
	for _, v := range str {
		fmt.Printf("타입:%T 값:%d 문자:%c\n", v, v, v)
	}

}

// len(str): 12
// 타입:uint8, 값:72, 문자값:H
// 타입:uint8, 값:101, 문자값:e
// 타입:uint8, 값:108, 문자값:l
// 타입:uint8, 값:108, 문자값:l
// 타입:uint8, 값:111, 문자값:o
// 타입:uint8, 값:32, 문자값:
// 타입:uint8, 값:236, 문자값:ì
// 타입:uint8, 값:155, 문자값:타
// 입:uint8, 값:148, 문자값:
// 타입:uint8, 값:235, 문자값:ë
// 타입:uint8, 값:147, 문자값:
// 타입:uint8, 값:156, 문자값:
// ---------------------------------
// len(arr): 8
// 타입:int32, 값:72, 문자값:H
// 타입:int32, 값:101, 문자값:e
// 타입:int32, 값:108, 문자값:l
// 타입:int32, 값:108, 문자값:l
// 타입:int32, 값:111, 문자값:o
// 타입:int32, 값:32, 문자값:
// 타입:int32, 값:50900, 문자값:월
// 타입:int32, 값:46300, 문자값:드
// ---------------------------------
// 타입:int32 값:72 문자:H
// 타입:int32 값:101 문자:e
// 타입:int32 값:108 문자:l
// 타입:int32 값:108 문자:l
// 타입:int32 값:111 문자:o
// 타입:int32 값:32 문자:
// 타입:int32 값:50900 문자:월
// 타입:int32 값:46300 문자:드
